INSERT INTO questions (question, field_type)
VALUES ( 'Как часто вы задавали вопросы по теме этому человеку во время ' ||
                            'беседы?', 'COMMUNICATION'),
       ( 'Как быстро вы подбирали ответ на вопросы этого человека?', 'COMMUNICATION'),
       ( 'Как часто вы понимали этого человека с полуслова?', 'COMMUNICATION'),
       ( 'На сколько успешно вы удерживали внимание этого человека во время разговора?',
        'COMMUNICATION'),
       (
        'Как часто вы выражали свое согласие или несогласие с точкой зрения этого человека во время обсуждения?',
        'COMMUNICATION'),
       (
        'Как часто вы использовали мимику, жесты и интонацию, чтобы улучшить понимание между вами и этим человеком?',
        'COMMUNICATION'),
       (
        'Насколько часто вы повторяли слова или фразы, которые сказал этот человек, чтобы подтвердить свое понимание?',
        'COMMUNICATION'),
       ( 'Как часто вы активно слушали этого человека без перебивания?', 'COMMUNICATION'),
       ( 'Как часто вы демонстрировали свою заинтересованность в разговоре?', 'COMMUNICATION'),

       ( 'Как часто вы делились с этим человеком своими чувствами и эмоциями?', 'TRUST'),
       ( 'Как часто вы были честны и откровенны с этим человеком?', 'TRUST'),
       ( 'Насколько часто вы разделяли с этим человеком свои мысли?', 'TRUST'),
       ( 'Насколько вы чувствуете, что этот человек слушает вас внимательно?', 'TRUST'),
       ( 'Насколько вы убеждены в том, что этот человек будет говорить вам правду?', 'TRUST'),
       ( 'Часто ли вы обсуждали с этим человеком личные темы?', 'TRUST'),
       ( 'Насколько вы уверены в том, что ваш собеседник сохранит ваши секреты?', 'TRUST'),
       ( 'Каков ваш уровень комфорта при обсуждении сложных ситуаций с этим человеком?', 'TRUST'),

       ( 'Как много времени вы сегодня провели вместе с этим человеком?', 'TIME'),
       ( 'Хватило ли вам проведенного времени с человеком?', 'TIME'),
       ( 'Как часто вы наслаждаетесь совместным времяпрепровождением?', 'TIME'),
       ( 'Как часто вы делаете что-то вместе?', 'TIME'),

       ( 'Как часто вы прислушивались к мнению этого человека?', 'RESPECT'),
       ( 'Как часто вы выражали благодарность за помощь, поддержку от этого человека?', 'RESPECT'),
       ( 'Как часто вы соблюдали границы и личное пространство этого человека?', 'RESPECT'),
       ( 'Насколько вы цените его умения, качества и достижения?', 'RESPECT'),
       ( 'Как часто вы активно слушаете этого человека без перебивания или прерывания?', 'RESPECT'),
       ( 'Как вы проявляете терпимость и понимание к его недостаткам и ошибкам?', 'RESPECT'),
       ( 'Насколько наличие уважения в вашем общении с этим человеком важно для вас?', 'RESPECT'),
       ( 'Насколько наличие данного контакта важно для вас?', 'RESPECT'),

       ( 'Оцените насколько вы пытались вникнуть в проблемы этого человека?', 'EMPATHY'),
       (
        'Как часто вы ставите себя на место этого человека и пытаетесь почувствовать его эмоции и переживания?',
        'EMPATHY'),
       (
        'Насколько вам важно понимание и сопереживание к его эмоциональным потребностям и переживаниям?', 'EMPATHY'),
       ( 'Оцените свою готовность слушать и поддерживать этого человека в трудных ситуациях?',
        'EMPATHY'),
       ( 'Насколько вы считаете важной поддержку этого человека?', 'EMPATHY'),
       ( 'Оцените то, как вы поддерживали этого человека?', 'EMPATHY');
